output: default
streamtags: []
groups:
  8kxTq0:
    name: Calculated fields
    description: adds calculated  and classification fields for OCSF
    index: 10
    disabled: false
asyncFuncTimeout: 1000
functions:
  - id: comment
    filter: "true"
    disabled: null
    conf:
      comment: The rest extracts fields into the flattened top level fields and
        creates the full event
  - id: regex_extract
    filter: "true"
    disabled: false
    conf:
      source: _raw
      iterations: 100
      overwrite: false
      regex: /%\w+-(?<cisco_severity>\d+)/
      regexList:
        - regex: /%\w+-\d-(?<category_uid>\d)/
        - regex: /%\w+-\d-(?<class_uid>\d{4})/
    description: Threat Severity
    final: false
  - id: comment
    filter: "true"
    disabled: null
    conf:
      comment: We need to rename the fields to the appropriate OCSF schema.
  - id: eval
    filter: "true"
    disabled: null
    conf:
      add:
        - disabled: false
          name: A_inside_dir
          value: _raw.match(/\s(\w+)\s[Ii]nside/)[1]
        - disabled: false
          name: A_outside_dir
          value: _raw.match(/\s(\w+)\s[Oo]utside/)[1]
        - disabled: false
          name: A_src_dir
          value: 'src_ip ? (C.Net.isPrivate(src_ip) ? "in" : "out") : undefined'
        - disabled: false
          name: A_dst_dir
          value: 'dst_ip ? (C.Net.isPrivate(dst_ip) ? "in" : "out") : undefined'
        - disabled: false
          name: connection_info__direction_id
          value: >-
            (A_src_dir == "in" && A_dst_dir == "out") ? "2" : 
               (A_src_dir == "out" && A_dst_dir == "in") ? "1" : 
               (A_src_dir == "in" && A_dst_dir == "in") ? "3" : 
               (A_inside_dir == "to" && (A_outside_dir == "for" || A_outside_dir == "from")) ? "1" : 
               (A_outside_dir == "to" && (A_inside_dir == "for" || A_inside_dir == "from")) ? "2" :
            "0"
      remove:
        - A_*
    description: Direction inferences
    final: false
  - id: rename
    filter: "true"
    disabled: false
    conf:
      wildcardDepth: 5
      rename:
        - currentName: _raw
          newName: raw_data
        - currentName: vendor
          newName: metadata__product__vendor_name
        - currentName: dest_interface
          newName: dst_endpoint__interface_name
        - currentName: dest_ip
          newName: dst_endpoint__ip
        - currentName: dest_port
          newName: dst_endpoint__port
        - currentName: src_interface
          newName: src_endpoint__interface_name
        - currentName: src_ip
          newName: src_endpoint__ip
        - currentName: src_port
          newName: src_endpoint__port
        - currentName: src_nt_domain
          newName: src_endpoint__domain
        - currentName: transport
          newName: connection_info__protocol
        - currentName: bytes
          newName: traffic__bytes
        - currentName: action
          newName: activity_name
    description: Rename fields so we can convert this into JSON.
  - id: eval
    filter: "true"
    disabled: null
    conf:
      add:
        - disabled: true
          name: metadata
          value: "{version: '1.0.0-rc.2', product: {name: 'Cisco ASA', vendor_name:
            'Cisco'}, uid: _raw.id, logged_time: time*1000000}"
        - disabled: false
          name: metadata__version
          value: "'1.0.0-rc.2'"
        - disabled: false
          name: metadata__product__name
          value: "'Cisco ASA'"
        - disabled: false
          name: metadata__product__vendor_name
          value: "'Cisco'"
        - disabled: false
          name: metadata__logged_time
          value: _time * 1000000
  - id: serialize
    filter: "true"
    disabled: false
    conf:
      type: json
      dstField: __tmp
      fields:
        - "!_*"
        - "!cribl_*"
        - "*"
    description: Push to internal __tmp field
  - id: code
    filter: "true"
    disabled: false
    conf:
      maxNumOfIterations: 5000
      code: |-
        function convertToNestedJSON(jsonString) {
          const jsonObj = JSON.parse(jsonString);
          const nestedObj = {};

          for (let key in jsonObj) {
            const nestedKeys = key.split('__');
            let currentObj = nestedObj;

            for (let i = 0; i < nestedKeys.length - 1; i++) {
              const nestedKey = nestedKeys[i];

              if (!(nestedKey in currentObj)) {
                currentObj[nestedKey] = {};
              }

              currentObj = currentObj[nestedKey];
            }

            currentObj[nestedKeys[nestedKeys.length - 1]] = jsonObj[key];
          }

          return JSON.stringify(nestedObj);

        }

        __e._tmp = convertToNestedJSON(__e.__tmp)
    description: Convert to nested JSON string
    final: false
  - id: serde
    filter: "true"
    disabled: false
    conf:
      mode: extract
      type: json
      srcField: _tmp
    description: Parse all the fields to top
  - id: comment
    filter: "true"
    disabled: null
    conf:
      comment: this section maps and calculates the classification and metadata type
        fields in the OCSF schema
  - id: eval
    filter: duration==undefined && start_time!=undefined && end_time!=undefined
    disabled: false
    conf:
      add:
        - name: duration
          value: " end_time - start_time"
    description: Calculate duration field if not mapped
    groupId: 8kxTq0
  - id: eval
    filter: "true"
    disabled: false
    conf:
      add:
        - name: activity_id
          value: '"Unknown"'
        - name: severity
          value: "cisco_severity == 0 ? \"Critical\" : cisco_severity == 1 ? 'Critical' :
            cisco_severity == 2 ? 'High' : cisco_severity == 3 ? 'Fatal' :
            cisco_severity == 4 ? \"Medium\" : cisco_severity == 5 ?\" Low\" :
            cisco_severity == 6 ? \"Information\" : cisco_severity == 7 ?
            \"Unknown\" : \"Unknown\"

            \ "
        - name: status_id
          value: "0"
        - name: status_code
          value: "''"
        - name: status_detail
          value: "''"
        - disabled: false
          name: activity
          value: "'Unknown'"
        - disabled: false
          name: unmapped
          value: "{'asa_code': asa_code,'cisco_action':activity_name}"
        - disabled: false
          name: _raw
          value: raw_data
      remove: []
    description: "EDIT ME: Classification fields for {given event type}"
    groupId: 8kxTq0
  - id: eval
    filter: "true"
    disabled: false
    conf:
      add:
        - name: activity_id
          value: "0"
        - name: severity_id
          value: cisco_severity
        - disabled: false
          name: status
          value: "status_id=='99' ? 'Other' : status || status_id=='0' ? 'Unknown' :
            status || status_id=='1' ? 'Success' : status || status_id=='2' ?
            'Failure' : status"
        - name: category_name
          value: "'Network Activity'"
        - name: category_uid
          value: "4"
        - name: class_name
          value: "'Network Activity'"
        - name: class_uid
          value: "4001"
        - name: type_uid
          value: class_uid * 100 + activity_id
        - name: type_name
          value: "class_name + ': ' + activity"
        - name: time
          value: _time
        - name: raw_data
          value: _raw
          disabled: false
        - name: app_name
          value: sourcetype
        - name: count
          value: repeat_count
        - disabled: false
          name: activity_name
          value: '"Unknown"'
      remove:
        - _raw
        - cribl_*
        - repeat_count
        - "*__*"
        - _time
    description: "Mapping for classification and context fields "
    groupId: 8kxTq0
  - id: eval
    filter: "true"
    disabled: false
    conf:
      remove:
        - "*"
      keep:
        - activity_name
        - activity_id
        - app_name
        - category_name
        - category_uid
        - class_name
        - class_uid
        - confidence
        - connection_info
        - count
        - data
        - dst_endpoint
        - duration
        - end_time
        - enrichments
        - time
        - message
        - metadata
        - observables
        - proxy
        - raw_data
        - severity
        - severity_id
        - src_endpoint
        - start_time
        - status
        - status_code
        - status_detail
        - status_id
        - tls
        - timezone_offset
        - traffic
        - type_uid
        - type_name
        - mapped
        - connection_info.boundary
        - connection_info.boundary_id
        - connection_info.uid
        - connection_info.direction
        - connection_info.direction_id
        - connection_info.protocol_ver
        - connection_info.protocol_ver_id
        - connection_info.protocol_name
        - connection_info.protocol_num
        - connection_info.tcp_flags
        - dst_endpoint.location
        - dst_endpoint.domain
        - dst_endpoint.hostname
        - dst_endpoint.ip
        - dst_endpoint.instance_uid
        - dst_endpoint.intermediate_ips
        - dst_endpoint.mac
        - dst_endpoint.name
        - dst_endpoint.interface_uid
        - dst_endpoint.interface_name
        - dst_endpoint.port
        - dst_endpoint.svc_name
        - dst_endpoint.subnet_uid
        - dst_endpoint.uid
        - dst_endpoint.vlan_uid
        - dst_endpoint.vpc_uid
        - traffic.bytes_in
        - traffic.bytes_out
        - traffic.packets_in
        - traffic.packets_out
        - traffic.bytes
        - traffic.packets
        - src_endpoint.location
        - src_endpoint.domain
        - src_endpoint.hostname
        - src_endpoint.ip
        - src_endpoint.instance_uid
        - src_endpoint.intermediate_ips
        - src_endpoint.mac
        - src_endpoint.name
        - src_endpoint.interface_uid
        - src_endpoint.interface_name
        - src_endpoint.port
        - src_endpoint.svc_name
        - src_endpoint.subnet_uid
        - src_endpoint.uid
        - rc_endpoint.vlan_uid
        - src_endpoint.vpc_uid
        - metadata.correlation_uid
        - metadata.uid
        - metadata.labels
        - metadata.logged_time
        - metadata.modified_time
        - metadata.original_time
        - metadata.processed_time
        - metadata.product
        - metadata.profiles
        - metadata.sequence
        - metadata.version
        - metadata.product.feature
        - metadata.product.lang
        - metadata.product.uid
        - metadata.product.name
        - metadata.product.path
        - metadata.product.version
        - metadata.product.vendor_name
        - metadata.product.feature.uid
        - metadata.product.feature.name
        - metadata.product.feature.version
        - connection_info.protocol
        - unmapped.*
        - unmapped
    groupId: 8kxTq0
    description: This is the final cleanup step. We are going to keep only fields
      that are within the
      https://schema.ocsf.io/classes/network_activity?extensions= spec and
      remove all others.
  - id: numerify
    filter: "true"
    disabled: false
    conf:
      format: none
      ignoreFields:
        - status_code
        - status_detail
      filterExpr: ""
      digits: 0
    description: Numerify where necessary
